# Pandas

In [1]:
import pandas as pd

In [35]:
a=pd.Series([])
b=pd.Series([1,2,33,47,58,100])
c=pd.Series((45,89,20,30,44))
d=pd.Series({'a':10,'b':15,'c':56,'d':99})

C:\Users\SSPO\AppData\Local\Temp\ipykernel_7740\1536678391.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a=pd.Series([])

In [4]:
a

Series([], dtype: float64)

In [6]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [7]:
c

0    45
1    89
2    20
3    30
4    44
dtype: int64

In [8]:
d

{'a': 10, 'b': 15, 'c': 56, 'd': 99}

In [9]:
import numpy as np

In [10]:
n = np.array([1,2,3,4,40])

In [11]:
n

array([ 1,  2,  3,  4, 40])

In [12]:
x=pd.Series(n)

In [13]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [14]:
type(a)

pandas.core.series.Series

In [15]:
type(n)

numpy.ndarray

In [16]:
type(x)

pandas.core.series.Series

In [24]:
b=pd.Series([1,2,[11,20],33,[12,23],47,58,100])

In [25]:
b

0           1
1           2
2    [11, 20]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [19]:
type(b)

pandas.core.series.Series

In [27]:
b[3:7]

3          33
4    [12, 23]
5          47
6          58
dtype: object

In [28]:
d

{'a': 10, 'b': 15, 'c': 56, 'd': 99}

In [30]:
d['d']

99

In [36]:
d['b':]

b    15
c    56
d    99
dtype: int64

In [48]:
s = pd.Series([12,52,42,10,23],index=list('asdfg'))

In [49]:
s

a    12
s    52
d    42
f    10
g    23
dtype: int64

In [50]:
s

a    12
s    52
d    42
f    10
g    23
dtype: int64

In [51]:
s1= pd.Series([12,52,12,52,10,23,42,10,23])

In [52]:
s1

0    12
1    52
2    12
3    52
4    10
5    23
6    42
7    10
8    23
dtype: int64

In [56]:
s1.value_counts()

12    2
52    2
10    2
23    2
42    1
dtype: int64

In [58]:
s1.argmax()

1

In [59]:
s1.argmin()

4

In [60]:
s1.idxmin()

4

In [63]:
s1.idxmax()

1

# DataFrame

In [65]:
a=pd.DataFrame()
b= pd.DataFrame([1,2,55,40,86])

In [66]:
a

Empty DataFrame
Columns: []
Index: []

In [67]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [68]:
type(a)

pandas.core.frame.DataFrame

In [69]:
c=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

In [70]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [86]:
d=pd.DataFrame([[1,2,3,4,5],[10,20,30,40,40],[7,8,9,10,11],[1,2,3,4,5],[10,20,30,40,50],[7,8,9,10,11],['a','b','c','d','e'],[12,12,23,34,53],])

In [87]:
d

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  40
2   7   8   9  10  11
3   1   2   3   4   5
4  10  20  30  40  50
5   7   8   9  10  11
6   a   b   c   d   e
7  12  12  23  34  53

In [88]:
d.head(2)

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  40

In [90]:
d.tail(4)

    0   1   2   3   4
4  10  20  30  40  50
5   7   8   9  10  11
6   a   b   c   d   e
7  12  12  23  34  53

In [95]:
d.sample(4)

    0   1   2   3   4
4  10  20  30  40  50
6   a   b   c   d   e
5   7   8   9  10  11
3   1   2   3   4   5

In [108]:
d=pd.DataFrame([[1,2,3],['a',np.nan,30,'Missing',40],[7,np.nan,9,10,np.nan],[1,2,3,4,5],[],[7,8,9,10,11],[23,34,53],])

In [109]:
d

      0     1     2        3     4
0     1   2.0   3.0     None   NaN
1     a   NaN  30.0  Missing  40.0
2     7   NaN   9.0       10   NaN
3     1   2.0   3.0        4   5.0
4  None   NaN   NaN     None   NaN
5     7   8.0   9.0       10  11.0
6    23  34.0  53.0     None   NaN

In [117]:
d=pd.DataFrame([[1,2,3],[1,2,3000],[7,8,9],[23,34,53]],columns=['Col1','col2','col3'])

In [118]:
d

   Col1  col2  col3
0     1     2     3
1     1     2  3000
2     7     8     9
3    23    34    53

In [125]:
d[['Col1','col3']][0:3]

   Col1  col3
0     1     3
1     1  3000
2     7     9

In [126]:
d.shape

(4, 3)

In [127]:
d

   Col1  col2  col3
0     1     2     3
1     1     2  3000
2     7     8     9
3    23    34    53

In [131]:
d['Col1'].max()

23

In [132]:
d['Col1'].min()

1

In [139]:
d['Col5']=[167,634,44,50]

In [140]:
d

   Col1  col2  col3  Col4  Col5
0     1     2     3     1   167
1     1     2  3000    24   634
2     7     8     9     4    44
3    23    34    53     5    50

In [143]:
d['Col6']=d['Col4'] * d['Col5']

In [144]:
d

   Col1  col2  col3  Col4  Col5   Col6
0     1     2     3     1   167    167
1     1     2  3000    24   634  15216
2     7     8     9     4    44    176
3    23    34    53     5    50    250

In [158]:
f = d['Col5']>50

In [159]:
d[f]

   Col1  col2  col3  Col4  Col5   Col6
0     1     2     3     1   167    167
1     1     2  3000    24   634  15216